app/controllers/groups_controller.rb

  def index
    @groups = Group.all
---
SELECT `groups`.* FROM `groups`

  def create
    p = group_params
    p[:owner] = current_user
    @group = Group.new(p)

    respond_to do |format|
      if @group.save
---
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('pardos', '2017-03-14 04:25:48', '2017-03-14 04:25:48')