app/controllers/pets_controller.rb

SELECT `pets`.* FROM `pets`
---
  def index
    @pets = Pet.all